#!/data/data/com.termux/files/usr/bin/python3
# CHARS TO CHANGE>
import subprocess, os
global txt

def copy2clip(txt):
    cmd='echo '+str(txt)+' | termux-clipboard-set'
    return subprocess.check_call(cmd, shell=True)

while 1:
    #charmap = {" ": " ", "a": "Ꭿ", "b": "Ᏼ", "c": "Ꮸ", "d": "Ꭰ", "e": "ℇ", "f": "∮", "g": "Ꮆ", "h": "Ꮵ", "i": "ⅈ", "j": "ፓ", "k": "Ꮶ", "l": "Ꮭ", "m": "Ꮇ", "n": "ℿ", "o": "ᝪ", "p": "ᚹ", "q": "ᕴ", "r": "ᚱ", "s": "Ꮥ", "t": "Ꮁ", "u": "ᙀ", "v": "ᜠ", "w": "ᙎ", "x": "ᛝ", "y": "ᛘ", "z": "ẑ"}
    #charmap = {"[": "[", "]": "]", "'": "'", ".": ".", "@": "@", "?": "?", " ": "  ", "0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "a": "Δ", "b": "β", "c": "Ϛ", "d": "Ꭰ", "e": "є", "f": "ғ", "g": "Ԍ", "h": "ի", "i": "أ", "j": "ᣫ", "k": "Ꮵ", "l": "Ꮭ", "m": "ϻ", "n": "п", "o": "Ѻ", "p": "ק", "q": "ዒ", "r": "Ꮢ", "s": "Ꮪ", "t": "ᡫ", "u": "Ⳙ" "Ⱌ", "w": "Ⱎ", "x": "Ⲭ", "y": "Ⲯ", "z": "ℤ"}
    charmap = {" ": "    ", "A": "A", "B": "B", "C": "C", "D": "D", "E": "E", "F": "F", "G": "G", "H": \
              "H", "I": "I", "J": "J", "K": "K", "L": "L", "M": "M", "N": "N", "O": "O", "P": "P", "Q": \
              "Q", "R": "R", "S": "S", "T": "T", "U": "U", "V": "V", "W": "W", "X": "X", "Y": "Y", "X": \
              "X", "a":"ₐ", "b": "b", "c": "c", "d": "d", "e": "ₑ", "f": "f", "g": "g", "h": "ₕ", "i": \
              "ᵢ", "j": "ⱼ", "k": "ₖ", "l": "ₗ", "m": "ₘ", "n": "ₙ", "o": "ₒ", "p": "ₚ", "q": "q", \
              "r": "ᵣ", "s": "ₛ", "t": "ₜ", "u": "ᵤ",  "v": "ᵥ", "w": "w",  "x": "ₓ", "y": "y", "z": "z", \
              "0": "₀", "1": "₁", "2": "₂", "3": "₃", "4": "₄", "5": "₅", "6": "₆", "7": "₇", "8": "₈", \
              "9": "₉", ".": ".",  "'": "\'", ',': "\,",  "?": "?", "@": "@",  "[": "[", "]": "]", "!": "!", \
              "_": "_", "-": "\-", "(": "\(", ")": "\)"}
    out = ["[c][i][b][badd11] "]
    msg = input("enter> ")
    for x in msg:
         if x in charmap:
             out.append(charmap[x])
         txt = "".join(out)
    print (txt)
    copy2clip (txt)
